Repository: AqueGen/Pr_oz_or_ro
Catalog: Web/Resources/GlobalRes.*.resx
Languages: ru

# Catalog
source: Довідка
ru: Справка

# LanguageShortName
source: UA
ru: RU

# Login
source: Увійти
ru: Войти

# Registration
source: Реєстрація
ru: Регистрация

# SearchTender
source: Пошук закупівлі
ru: Поиск закупки

# SupportService
source: Служба підтримки
ru: Служба поддержки

# Tariff
source: Тарифи
ru: Тарифы

# TradePlatform
source: Торгівельний майданчик
ru: Торговая площадка

# WorkWithUs
source: З нами вже співпрацюють
ru: С нами уже сотрудничают

# CompanyName
source: Наіменування компанії
ru: Наименование компании

# ConfirmEmail
source: Підтвердіть E-mail
ru: Подтвердите E-mail

# ConfirmPassword
source: Підтвердіть пароль
ru: Подтвердите пароль

# CreateNewAccount
source: Створити новий аккаунт
ru: Создать новый аккаунт

# Customer
source: Замовнику
ru: Заказчику

# FieldMustBeDate
source: Поле "{0}" повинно бути датою.
ru: Поле "{0}" должно быть датой.

# FieldMustBeNumeric
source: Поле "{0}" повинно бути числом.
ru: Поле "{0}" должно быть числом.

# FirstName
source: Ім'я
ru: Имя

# LastName
source: Прізвище
ru: Фамилия

# LegalCompany
source: Юридична особа
ru: Юридическое лицо

# PhysicalCompany
source: Фізична особа
ru: Физическое лицо

# PropertyValueInvalid
source: Значення "{0}" неправильне для {1}.
ru: Значение "{0}" неправильное для {1}.

# PropertyValueRequired
source: Значення обов'язкове.
ru: Значение обязательна.

# Provider
source: Постачальнику
ru: Поставщику

# RequiredAttribute
source: Поле "{0}" обов'язкове.
ru: Поле "{0}" обязательно.

# Search
source: Знайти
ru: Найти

# SearchParameters
source: Параметри пошуку
ru: Параметры поиска

# EmailAddressAttribute
source: Поле "{0}" містить невірну e-mail адресу.
ru: Поле "{0}" содержит неверный e-mail адрес.

# CompareAttribute
source: Поле "{1}" і "{0}" не співпадають.
ru: Поля "{1}" и "{0}" не совпадают.

# MaxLengthAttribute
source: Значення поля "{0}" не може бути більше {1}.
ru: Значение поля "{0}" не может быть больше {1}.

# MinLengthAttribute
source: Значення поля "{0}" не може бути менше {1}.
ru: Значение поля "{0}" не может быть меньше {1}.

# StringLengthAttribute
source: Поле "{0}" не може бути більше {1} символів.
ru: Поле "{0}" не может быть больше {1} символов.

# About
source: Про компанію
ru: О компании

# invalid_input_response
source: Параметр відповіді є недійсним або неправильний формат.
ru: Параметр ответа является недействительным или неправильный формат.

# invalid_input_secret
source: Секретний параметр відсутній.
ru: Секретный параметр отсутствует.

# missing_input_response
source: Параметр відповіді відсутній.
ru: Параметр ответа отсутствует.

# missing_input_secret
source: Секретний параметр недійсний або має неправильний формат.
ru: Секретный параметр недействителен или имеет неправильный формат.

# error_occured
source: Виникла помилка. Будь ласка спробуйте ще раз
ru: Ошибка. Пожалуйста попробуйте еще раз

# LanguageCode
source: uk
ru: ru

# SearchUnderLine
source: Пошук закупівлі
ru: Поиск закупки

# CustomerUnderLine
source: Створити закупівлю
ru: Создать закупку

# ProviderUnderLine
source: Взяти участь у закупівлях
ru: Взять участие в закупках

# LoginUnderLine
source: Використовуйте локальну обліковий запис, щоб увійти
ru: Используйте локальную учетную запись, чтобы войти

# RememberMe
source: Запам'ятати мене
ru: Запомнить меня

# RegisterAsNewUser
source: Реєстрація нового користувача
ru: Регистрация нового пользователя

# ForgotYourPassword
source: Забули пароль?
ru: Забыли пароль?

# Keyword
source: Ключове слово
ru: Ключевое слово

# Procurer
source: Замовник
ru: Заказчик

# Region
source: Регіон
ru: Регион

# ApplicationsSubmissionDate
source: Дата приймання пропозицій
ru: Дата принятия предложений

# ClarificationDate
source: Дата періоду уточнень
ru: Дата периода уточнений

# AuctionDate
source: Дата аукціону
ru: Дата аукциона

# QualificationDate
source: Дата кваліфікації
ru: Дата квалификации

# ProcurementNumber
source: № закупівлі
ru: № закупки

# MiddleName
source: По-батькові
ru: Отчество

# CompanyType
source: Тип компанії
ru: Тип компании

# ChangeProfile
source: Змінити профіль
ru: Изменить профиль

# ChangePassword
source: Змінити пароль
ru: Изменить пароль

# NavigateToCabinet
source: Перейти в кабінет
ru: Перейти в кабинет

# PersonalCabinet
source: Персональний кабінет
ru: Персональный кабинет

# PersonalData
source: Персональні данні
ru: Персональный данные

# EditPersonalData
source: Редагування персональних данних
ru: Редактирование персональных данных

# Save
source: Зберегти
ru: Сохранить

# Cancel
source: Відміна
ru: Отмена

# CurrentPassword
source: Поточний пароль
ru: Текущий пароль

# NewPassword
source: Новий пароль
ru: Новый пароль

# ConfirmNewPassword
source: Підтвердити новий пароль
ru: Подтвердить новый пароль

# ProfileSettings
source: Налаштування профілю
ru: Настройки профиля

# Messages
source: Повідомлення
ru: Сообщения

# MemberTenders
source: Список заявок на участь в торгах
ru: Список заявок на участие в торгах

# MyTenders
source: Список заявок на замовлення торгів
ru: Список заявок на заказ торгов

# CompanyType_Individual
source: Фізична особа
ru: Физическое лицо

# CompanyType_Corporation
source: Юридична особа
ru: Юридическое лицо

# CheckIfAttribute
source: Поле "{0}" обов'язкове.
ru: Поле "{0}" обязательно.

# Title
source: Заголовок
ru: Заглавие

# ProcedurePeriod
source: Планова дата початку процедури
ru: Планированная дата начала процедуры

# ProcedureType
source: Тип процедури
ru: Тип процедуры

# PlanNumber
source: Номер плану
ru: Номер плана

# CreateDraftTender
source: Створити тендер-чернетку
ru: Создать тендер черновик

# Next
source: Наступний
ru: Следующий

# EditDraftTender
source: Редагувати тендер-чернетку
ru: Редактировать тендер-черновик

# Forward
source: Вперед
ru: Вперёд

# ProcurementObjects
source: Об'єкти закупівлі
ru: Объекты закупки

# AddLot
source: Додати лот
ru: Добавить лот

# AddItem
source: Додати закупку
ru: Добавить закупку

# AddFeature
source: Додати критерій
ru: Добавить критерий

# Name
source: Наіменування
ru: Название

# Description
source: Опис
ru: Описание

# Edit
source: Редагувати
ru: Редактировать

# Object
source: Об'єкт
ru: Обьект

# Delete
source: Видалити
ru: Удалить
